package com.xjd.mol.util.constants;

/**
 * <pre>
 * 返回码
 * 0000 ~ 0049	基础公用返回码
 * 0050 ~ 0099	用户相关返回码
 * 0100 ~ 0199	账单相关返回码
 * 0200 ~ 0299	支付工具相关返回码
 * 0300 ~ 0399	支付相关返回码
 * </pre>
 * 
 * @author elvis.xu
 * @since 2014-9-16
 */
public interface RespCode {

	// ==== 0000 ~ 0049 基础公用返回码 ==== //
	/** 成功 */
	String RESP_0000 = "0000";

	/** 请求必须签名 */
	String RESP_0001 = "0001";

	/** 签名验证失败 */
	String RESP_0002 = "0002";

	/** 验证码错误 */
	String RESP_0003 = "0003";

	/** 参数{0}不能为空 */
	String RESP_0005 = "0005";

	/** 参数{0}格式错误 */
	String RESP_0006 = "0006";

	/** 参数{0}的日期/时间格式不正确 */
	String RESP_0010 = "0010";

	/** 参数{0}必须为有效的枚举值 */
	String RESP_0011 = "0011";

	// ==== 0050 ~ 0099 用户相关返回码 ==== //
	/** 该服务需要Token */
	String RESP_0051 = "0051";

	/** 无效的Token */
	String RESP_0052 = "0052";

	/** Token已过期 */
	String RESP_0053 = "0053";

	/** 未查询到用户信息, 请联系管理员 */
	String RESP_0054 = "0054";

	/** 您的手机尚未绑定, 请先绑定手机 */
	String RESP_0055 = "0055";

	/** 您的身份信息尚未认证, 请先实名认证 */
	String RESP_0056 = "0056";

	/** 您尚未登录, 请先登录 */
	String RESP_0057 = "0057";

	// ==== 0100 ~ 0199 账单相关返回码 ==== //
	/** 未查询到订单, 订单号: {0} */
	String RESP_0101 = "0101";
	
	// ==== 0200 ~ 0299 支付工具相关返回码 ==== //
	/** 您输入的付费通卡不是VIP卡, 请输入VIP卡卡号 */
	String RESP_0201 = "0201";
	
	/** 对不起, 系统不支持对{0}的余额查询 */
	String RESP_0202 = "0202";

	// ==== 0300 ~ 0399 支付相关返回码 ==== //

	/** RPC返回应答码非成功: 显示RPC返回的错误信息 */
	String RESP_9996 = "9996";
	/** 服务不可用 */
	String RESP_9997 = "9997";
	/** 系统维护中: 显示配置的维护消息 */
	String RESP_9998 = "9998";
	/** 内部错误,请稍后再试或联系管理员 */
	String RESP_9999 = "9999";
}
